<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"db6470022bb856acfef310b788a44929257ac77601b05f5990ea4f401fe990ac","plan_job_ref":"Job ci cd #124 at https://github.com/HossainAhnaf/terraform/actions/runs/16514088951","plan_out_hash":"c90d8a02b5e9ec60994107dff4c3991516353c1d49f3f5879555e7dc62dff8b7","plan_hash":"57b9978f5cbc09f2f4881badbf64022b004a6e9d36074cc3290931441d8d72a7","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __.__ in the __prod__ workspace
With var files: `prod.tfvars`
<details>
<summary>Plan: 24 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "centralus"
+       name     = "rg-spring-react-devops-prod-centralus"
    }

  # azurerm_virtual_network.main will be created
+   resource "azurerm_virtual_network" "main" {
+       address_space                  = [
+           "10.0.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "centralus"
+       name                           = "vnet-spring-react-devops-prod-centralus"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-spring-react-devops-prod-centralus"
+       subnet                         = (known after apply)
    }

  # module.asp.azurerm_monitor_autoscale_setting.app_service_plan_autoscale[0] will be created
+   resource "azurerm_monitor_autoscale_setting" "app_service_plan_autoscale" {
+       enabled             = true
+       id                  = (known after apply)
+       location            = "centralus"
+       name                = "mas-spring-react-devops-prod-centralus"
+       resource_group_name = "rg-spring-react-devops-prod-centralus"
+       target_resource_id  = (known after apply)

+       profile {
+           name = "default-autoscale-profile"

+           capacity {
+               default = 1
+               maximum = 2
+               minimum = 1
            }

+           rule {
+               metric_trigger {
+                   metric_name        = "CpuPercentage"
+                   metric_resource_id = (known after apply)
+                   operator           = "GreaterThan"
+                   statistic          = "Average"
+                   threshold          = 70
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"
                }
+               scale_action {
+                   cooldown  = "PT1M"
+                   direction = "Increase"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
+           rule {
+               metric_trigger {
+                   metric_name        = "CpuPercentage"
+                   metric_resource_id = (known after apply)
+                   operator           = "LessThan"
+                   statistic          = "Average"
+                   threshold          = 30
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"
                }
+               scale_action {
+                   cooldown  = "PT1M"
+                   direction = "Decrease"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
        }
    }

  # module.backend.azurerm_app_service_virtual_network_swift_connection.backend will be created
+   resource "azurerm_app_service_virtual_network_swift_connection" "backend" {
+       app_service_id = (known after apply)
+       id             = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.backend.azurerm_subnet.backend_subnet will be created
+   resource "azurerm_subnet" "backend_subnet" {
+       address_prefixes                              = [
+           "10.0.2.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "snet-backend-spring-react-devops-centralus"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-spring-react-devops-prod-centralus"
+       virtual_network_name                          = "vnet-spring-react-devops-prod-centralus"

+       delegation {
+           name = "appServiceDelegation"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.database.azurerm_mysql_flexible_database.main will be created
+   resource "azurerm_mysql_flexible_database" "main" {
+       charset             = "utf8mb4"
+       collation           = "utf8mb4_unicode_ci"
+       id                  = (known after apply)
+       name                = "mysqldb-db-spring-react-devops-prod-centralus"
+       resource_group_name = "rg-spring-react-devops-prod-centralus"
+       server_name         = "mysql-db-spring-react-devops-prod-centralus"
    }

  # module.database.azurerm_mysql_flexible_server.main will be created
+   resource "azurerm_mysql_flexible_server" "main" {
+       administrator_login           = "mysqladmin"
+       administrator_password        = (sensitive value)
+       administrator_password_wo     = (write-only attribute)
+       backup_retention_days         = 7
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = true
+       id                            = (known after apply)
+       location                      = "centralus"
+       name                          = "mysql-db-spring-react-devops-prod-centralus"
+       private_dns_zone_id           = (known after apply)
+       public_network_access         = "Disabled"
+       public_network_access_enabled = (known after apply)
+       replica_capacity              = (known after apply)
+       replication_role              = (known after apply)
+       resource_group_name           = "rg-spring-react-devops-prod-centralus"
+       sku_name                      = "B_Standard_B1ms"
+       version                       = "8.0.21"
+       zone                          = (known after apply)

+       storage {
+           auto_grow_enabled   = true
+           io_scaling_enabled  = true
+           iops                = (known after apply)
+           log_on_disk_enabled = false
+           size_gb             = 100
        }
    }

  # module.database.azurerm_private_dns_zone.server will be created
+   resource "azurerm_private_dns_zone" "server" {
+       id                                                    = (known after apply)
+       max_number_of_record_sets                             = (known after apply)
+       max_number_of_virtual_network_links                   = (known after apply)
+       max_number_of_virtual_network_links_with_registration = (known after apply)
+       name                                                  = "privatelink.mysql.database.azure.com"
+       number_of_record_sets                                 = (known after apply)
+       resource_group_name                                   = "rg-spring-react-devops-prod-centralus"

+       soa_record (known after apply)
    }

  # module.database.azurerm_private_dns_zone_virtual_network_link.server will be created
+   resource "azurerm_private_dns_zone_virtual_network_link" "server" {
+       id                    = (known after apply)
+       name                  = "pls-db-spring-react-devops-prod-centralus"
+       private_dns_zone_name = "privatelink.mysql.database.azure.com"
+       registration_enabled  = false
+       resource_group_name   = "rg-spring-react-devops-prod-centralus"
+       virtual_network_id    = (known after apply)
    }

  # module.database.azurerm_private_endpoint.mysql_pe will be created
+   resource "azurerm_private_endpoint" "mysql_pe" {
+       custom_dns_configs       = (known after apply)
+       id                       = (known after apply)
+       location                 = "centralus"
+       name                     = "pe-db-spring-react-devops-prod-centralus"
+       network_interface        = (known after apply)
+       private_dns_zone_configs = (known after apply)
+       resource_group_name      = "rg-spring-react-devops-prod-centralus"
+       subnet_id                = (known after apply)

+       private_dns_zone_group {
+           id                   = (known after apply)
+           name                 = "pdnszg-db-spring-react-devops-prod-centralus"
+           private_dns_zone_ids = (known after apply)
        }

+       private_service_connection {
+           is_manual_connection           = false
+           name                           = "psc-db-spring-react-devops-prod-centralus"
+           private_connection_resource_id = (known after apply)
+           private_ip_address             = (known after apply)
+           subresource_names              = [
+               "mysqlServer",
            ]
        }
    }

  # module.database.azurerm_subnet.server_subnet will be created
+   resource "azurerm_subnet" "server_subnet" {
+       address_prefixes                              = [
+           "10.0.1.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "snet-db-spring-react-devops-prod-centralus"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-spring-react-devops-prod-centralus"
+       virtual_network_name                          = "vnet-spring-react-devops-prod-centralus"
    }

  # module.asp.module.avm-res-web-serverfarm.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "centralus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "plan-spring-react-devops-prod-centralus"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-spring-react-devops-prod-centralus"
+       sku_name                        = "S1"
+       worker_count                    = 1
+       zone_balancing_enabled          = false
    }

  # module.asp.module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp.module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend.module.avm-res-web-site.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-app-backend-spring-react-devops-centralus"
+       resource_group_name                 = "rg-spring-react-devops-prod-centralus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.backend.module.avm-res-web-site.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-backend-spring-react-devops-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-spring-react-devops-prod-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-backend:latest"
+               docker_registry_url = "https://ghcr.io/hossainahnaf"
            }
        }
    }

  # module.backend.module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend.module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.database.module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.database.module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend.module.avm-res-web-site.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-app-frontend-spring-react-devops-prod-centralus"
+       resource_group_name                 = "rg-spring-react-devops-prod-centralus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.frontend.module.avm-res-web-site.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-frontend-spring-react-devops-prod-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-spring-react-devops-prod-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-frontend:latest"
+               docker_registry_url = "https://ghcr.io/hossainahnaf"
            }
        }
    }

  # module.frontend.module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend.module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   backend_api_url = "https://app-backend-spring-react-devops-centralus.azurewebsites.net"
+   frontend_url    = "https://app-frontend-spring-react-devops-prod-centralus.azurewebsites.net"
```
</details>

:memo: Plan generated in [ci cd #124](https://github.com/HossainAhnaf/terraform/actions/runs/16514088951)